paulusTecnion/uberlogger-stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "esp32_interface.h"
#include "stdint.h"
#include "string.h"
#include <time.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define SPI_BUFFERSIZE_BYTES 1020
#define ADC_BUFFERSIZE_SAMPLES 960
#define ADC_BUFFERSIZE_BYTES ADC_BUFFERSIZE_SAMPLES*2
#define GPIO_IO_BUFFERSIZE 120
#define GPIO_IO_BUFFERIZE_BYTES GPIO_IO_BUFFERSIZE
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi1_rx;

TIM_HandleTypeDef htim3;

/* USER CODE BEGIN PV */
uint8_t MainState = MAIN_IDLE, NextState = MAIN_IDLE;
uint8_t logging_en = 0;
uint8_t msgRx = 0;
uint8_t RxBuffer[1];


// SPI buffer size is 1024 bytes
// 8 ADC channels + 1 byte for all IO/s = 2*8+1 = 17 bytes per sample row
// This will fit floor(1024/17) = 60 samples of data.
// That means 1020 / 17 = 60 samples of ADC data and IO data
// Which equals 8*60 = 480 ADC samples (960 bytes) and 1*60 = 60 IO samples (60 bytes)
// So in order to have a circular buffer we will need:
// 960 = 960 samples (=1920*2 bytes) for the ADC
// 60*2 = 120 samples (=120 bytes) for the IO

// To conclude: per SPI transaction a total of 60*17 = 1020 bytes will be sent.
// The SD card, however, prefers block of power of 2, which means 1024 is closest.
// The remaining 4 bytes will be stuffed with 0's on the ESP side.
// In the future we could use the last 4 bytes for CRC



union _adc_result{
	uint16_t t16[ADC_BUFFERSIZE_SAMPLES];
	uint8_t t8[ADC_BUFFERSIZE_BYTES];
};

uint16_t  counter;

union _adc_result adc_result;
uint8_t gpio_result[GPIO_IO_BUFFERSIZE];

// Don't touch order of struct!
struct {
	uint8_t adc[ADC_BUFFERSIZE_BYTES/2];
	uint8_t gpio[GPIO_IO_BUFFERSIZE/2];
} spi_buffer;

volatile uint16_t gpio_result_write_ptr;

static RTC_TimeTypeDef sTimestamp;
static RTC_DateTypeDef sTimeStampDate;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM3_Init(void);
static void MX_RTC_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef * hspi)
{
	// When a non-circular DMA transfer is finished, the DMA transfer has to be disabled
	HAL_SPI_DMAStop(&hspi1);
	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
}

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef * hspi)
{
	// Successfully transmitted values. Set data ready pin to low a
//	MainState = MAIN_ADC_START;
//	spiDone = 1;
//	HAL_SPI_DMAStop(&hspi1);
//	msgRx = 1;
//	HAL_SPI_DMAStop(&hspi1);
	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
}

//void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef * hspi)
//{
//	msgRx = 1;
//	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
//}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	HAL_SPI_DMAStop(&hspi1);
	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
  //Error_Handler();
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
 /* Prevent unused argument(s) compilation warning */
	 // Check which version of the timer triggered this callback and toggle LED
	if (htim == &htim3 )
	  {

		  // 0x50000411 = GPIOB, 2nd byte (GPIOB8 to GPIOB15)
	    memcpy((void*) (gpio_result + gpio_result_write_ptr), (void*) 0x50000411, 1);
//		gpio_result = gpio_result_write_ptr;
	    gpio_result_write_ptr++;
	  }
	  if (gpio_result_write_ptr > GPIO_IO_BUFFERIZE_BYTES-8)
		  gpio_result_write_ptr =0;

}

void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{
	HAL_StatusTypeDef ret;
	// Half way we have the pointers start at the beginning
	memcpy(spi_buffer.gpio, gpio_result, GPIO_IO_BUFFERSIZE/2);
	memcpy(spi_buffer.adc, adc_result.t8, ADC_BUFFERSIZE_BYTES/2);

 	ret= HAL_SPI_Transmit_DMA(&hspi1, (uint8_t*)&spi_buffer,   SPI_BUFFERSIZE_BYTES);
 	if (ret == HAL_OK)
 		HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_SET);

}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
	HAL_StatusTypeDef ret;

	// At the last ADC sample, way we have the pointers start halfway

	memcpy(spi_buffer.gpio, gpio_result+GPIO_IO_BUFFERSIZE/2, GPIO_IO_BUFFERSIZE/2);
	memcpy(spi_buffer.adc, adc_result.t8+ADC_BUFFERSIZE_BYTES/2, ADC_BUFFERSIZE_BYTES/2);

	ret = HAL_SPI_Transmit_DMA(&hspi1,  (uint8_t*) (&spi_buffer),   SPI_BUFFERSIZE_BYTES);
	if (ret == HAL_OK)
		HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_SET);

