paulusTecnion/uberlogger-stm32/Core/Src/main.c
}

void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{
	adc_result.t8[0] = 255;
}

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
			logging_en = 1;
	}
}

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
		//HAL_SPI_DMAStop(&hspi1);

		logging_en = 0;

	}
}


uint8_t HAL_SPI_Send_cmd(spi_cmd_resp_t cmd, spi_cmd_esp_t cmd_esp)
{

	uint8_t t8[2];
	t8[0] = (uint8_t)cmd;
	t8[1] = cmd_esp;
	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_SET);
	HAL_StatusTypeDef errorcode = HAL_SPI_TransmitReceive(&hspi1, t8, RxBuffer, 2, 2000);

	if (errorcode == HAL_OK)
	{
		// Indicate to esp32 that data is ready
		HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
		// wait until transfer is done. Note that on a hardware level this may not have been sent yet!
//		while(hspi1.State == HAL_SPI_STATE_BUSY_TX_RX);
	}
	return errorcode;
}




/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  // Always receive
//	  if (!logging_en && hspi1.State == HAL_SPI_STATE_READY && msgRx == 0)
//	  {
//		  HAL_SPI_Receive_DMA(&hspi1, RxBuffer, 2);
//	  }
//	  HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN

	  // Get the current time from the RTC
	     RTC_TimeTypeDef current_time;

	     memset(&sTimestamp, 0, sizeof(sTimestamp));
	     memset(&sTimeStampDate, 0, sizeof(sTimeStampDate));

	     sTimestamp.Hours = 14;
	     sTimestamp.Minutes = 58;
	     sTimeStampDate.WeekDay = 0;
	     sTimeStampDate.Year = 23;
	     sTimeStampDate.Month = 1;
	     sTimeStampDate.Date = 25;


	     HAL_RTC_SetTime(&hrtc, &sTimestamp, RTC_FORMAT_BCD);
	     HAL_RTC_SetDate(&hrtc, &sTimeStampDate, RTC_FORMAT_BCD);

	     HAL_RTC_GetTime(&hrtc, &current_time, RTC_FORMAT_BCD);

	     RTC_DateTypeDef current_date;
	     HAL_RTC_GetDate(&hrtc, &current_date, RTC_FORMAT_BCD);






	  switch(MainState)
	  {
		  case MAIN_IDLE:
			  if (logging_en)
			  {
				  HAL_TIM_Base_Start_IT(&htim3);
				  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_result.t16, ADC_BUFFERSIZE_SAMPLES);
				  counter =0;
				  NextState = MAIN_LOGGING;
			  } else {
				  Idle_Handler();
			  }
			  break;

		  case MAIN_CONFIG:
			  Config_Handler();
			  break;

		  case MAIN_LOGGING:
			  // Doing nothing
			  if (!logging_en)
			  {
//				  currentTick = HAL_GetTick();
//				  // Wait for SPI to finish any remaining transmissions.
//				  while(hspi1.State == HAL_SPI_STATE_BUSY_TX)
//				  {
//					  differenceTick = currentTick - HAL_GetTick();
//					  if (differenceTick> 750)
//					  {
//
//						 HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
//						 break;
//					  }
//
//				  }
//				  HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
				  HAL_TIM_Base_Stop_IT(&htim3);
				  HAL_ADC_Stop_DMA(&hadc1);
				  HAL_SPI_DMAStop(&hspi1);
				  NextState = MAIN_IDLE;
			  }
			  break;

	  }

	  if (NextState != MainState)
	  {
		  MainState = NextState;
	  }

  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV1;
  RCC_OscInitStruct.PLL.PLLN = 8;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;
  hadc1.Init.LowPowerAutoWait = DISABLE;
  hadc1.Init.LowPowerAutoPowerOff = DISABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.NbrOfConversion = 8;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConv = ADC_EXTERNALTRIG_T3_TRGO;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
  hadc1.Init.DMAContinuousRequests = ENABLE;
  hadc1.Init.Overrun = ADC_OVR_DATA_PRESERVED;
  hadc1.Init.SamplingTimeCommon1 = ADC_SAMPLETIME_1CYCLE_5;
  hadc1.Init.SamplingTimeCommon2 = ADC_SAMPLETIME_1CYCLE_5;
  hadc1.Init.OversamplingMode = DISABLE;
  hadc1.Init.TriggerFrequencyMode = ADC_TRIGGER_FREQ_HIGH;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

