paulusTecnion/uberlogger-stm32/Core/Src/main.c
  /*Configure GPIO pins : AIN_RANGE_SELECT_CLK_Pin AIN_RANGE_SELECT_CLR_Pin AIN_PULLUP_SELECT_CLR_Pin */
  GPIO_InitStruct.Pin = AIN_RANGE_SELECT_CLK_Pin|AIN_RANGE_SELECT_CLR_Pin|AIN_PULLUP_SELECT_CLR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : PD2 */
  GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : STM_DATA_RDY_Pin */
  GPIO_InitStruct.Pin = STM_DATA_RDY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(STM_DATA_RDY_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : STM_ADC_EN_Pin */
  GPIO_InitStruct.Pin = STM_ADC_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(STM_ADC_EN_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI4_15_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_15_IRQn);

}

/* USER CODE BEGIN 4 */

static uint8_t Config_Set_Sample_freq(uint8_t sampleFreq)
{
	// Make sure timer3 has stopped
	HAL_TIM_Base_Stop_IT(&htim3);


	 htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
	 htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	 htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

	 switch(sampleFreq)
	 {
	 case ADC_SAMPLE_RATE_1Hz:
		 // Reconfig the timer
		 htim3.Init.Prescaler = 1000;
		 htim3.Init.Period = 64000;
		 break;


	 case ADC_SAMPLE_RATE_10Hz:
		 htim3.Init.Prescaler = 100;
		 htim3.Init.Period = 64000;
		 break;

	 case ADC_SAMPLE_RATE_25Hz:
		 htim3.Init.Prescaler = 100;
		 htim3.Init.Period = 25600;
		 break;

	 case ADC_SAMPLE_RATE_50Hz:
		 htim3.Init.Prescaler = 100;
		 htim3.Init.Period = 12800;
		 break;
	 case 	ADC_SAMPLE_RATE_100Hz:
		htim3.Init.Prescaler = 10;
		htim3.Init.Period = 64000;
		 break;

	 case 	ADC_SAMPLE_RATE_200Hz:
		 htim3.Init.Prescaler = 10;
		 htim3.Init.Period = 32000;

		 break;

	 case ADC_SAMPLE_RATE_400Hz:
		 htim3.Init.Prescaler = 10;
		 htim3.Init.Period = 16000;

		 break;

	 case ADC_SAMPLE_RATE_500Hz:
		 htim3.Init.Prescaler = 10;
		 htim3.Init.Period = 12800;

		 break;

	 case ADC_SAMPLE_RATE_1000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 64000;

	 break;

	 case ADC_SAMPLE_RATE_2000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 64000;

		 break;

	 case ADC_SAMPLE_RATE_4000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 16000;

		 break;

	 case ADC_SAMPLE_RATE_5000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 12800;

		 break;

	 case ADC_SAMPLE_RATE_8000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 8000;

		 break;
	 case ADC_SAMPLE_RATE_10000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 6400;

		 break;
	 case ADC_SAMPLE_RATE_20000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 3200;

		 break;

	 case ADC_SAMPLE_RATE_40000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 1600;

		 break;

	 case ADC_SAMPLE_RATE_50000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 1280;

		 break;

	 case ADC_SAMPLE_RATE_100000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 640;

		 break;

	 case ADC_SAMPLE_RATE_250000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 256;

		 break;

	 case ADC_SAMPLE_RATE_500000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 128;

		 break;

	 case ADC_SAMPLE_RATE_1000000Hz:
		 htim3.Init.Prescaler = 1;
		 htim3.Init.Period = 64;

		 break;
		 // Unknown rate
	 default:
	 	return 1;

	 }

	 // Reinit timer
	 if (HAL_TIM_Base_Init(&htim3) != HAL_OK)
	  {
	    return 1;
	  }


	 return 0;
}


static uint8_t Config_Enable_Adc_channel (uint8_t channel, uint8_t rank)
{
	ADC_ChannelConfTypeDef sConfig = {0};

	switch (channel)
	{

		case 0:
			sConfig.Channel = ADC_CHANNEL_0;
			break;

		case 1:
			sConfig.Channel = ADC_CHANNEL_1;
		break;

		case 2:
			sConfig.Channel = ADC_CHANNEL_2;
				break;

		case 3:
			sConfig.Channel = ADC_CHANNEL_3;
				break;

		case 4:
			sConfig.Channel = ADC_CHANNEL_4;
				break;

		case 5:
			sConfig.Channel = ADC_CHANNEL_5;
				break;

		case 6:
			sConfig.Channel = ADC_CHANNEL_6;
				break;

		case 7:
			sConfig.Channel = ADC_CHANNEL_7;
				break;

		default:
			return 1;
	}


	switch (rank)
		{

			case 1:
				sConfig.Rank = ADC_REGULAR_RANK_1;
			break;

			case 2:
				sConfig.Rank = ADC_REGULAR_RANK_2;
					break;

			case 3:
				sConfig.Rank = ADC_REGULAR_RANK_3;
					break;

			case 4:
				sConfig.Rank = ADC_REGULAR_RANK_4;
					break;

			case 5:
				sConfig.Rank = ADC_REGULAR_RANK_5;
					break;

			case 6:
				sConfig.Rank = ADC_REGULAR_RANK_6;
					break;

			case 7:
				sConfig.Rank = ADC_REGULAR_RANK_7;
					break;

			case 8:
				sConfig.Rank = ADC_REGULAR_RANK_8;
				break;

			default:
				return 1;

		}




	sConfig.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;
	if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
	{
		Error_Handler();
	}

	return 0;



}

static uint8_t Config_Set_Adc_channels(uint8_t channels)
{

	uint8_t channel_num=1,j, rank =1;

	// first find number of channels
	for (j=1; j<128; j = j << 1)
	{
		if (channels & j)
			channel_num++;
	}
	// Initiate number of channels
	 hadc1.Init.NbrOfConversion = channel_num;

	 if (HAL_ADC_Init(&hadc1) != HAL_OK)
	  {
		Error_Handler();
		return 1;
	  }

	 channel_num = 0;
	// Mask channels data and see which ones are enabled (again)
	for (j = 1; j<128; j = j << 1)
	{
		// If channel is enabled...
		if (channels & j)
		{
			// Activate it in the first available rank. Return 1 on error.
			if (Config_Enable_Adc_channel(channel_num, rank)) return 1;
			rank++;

		}
		channel_num++; // Keep track of which channel number we are checking
	}


	return 0;
}

static uint8_t Config_Set_Resolution(uint8_t resolution)
{
	switch (resolution)
	{


	case ADC_16_BITS:
		hadc1.Init.OversamplingMode = ENABLE;
		  hadc1.Init.Oversampling.Ratio = ADC_OVERSAMPLING_RATIO_256;
		  hadc1.Init.Oversampling.RightBitShift = ADC_RIGHTBITSHIFT_4;
		  hadc1.Init.Oversampling.TriggeredMode = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;
		break;

	//case ADC_12_BITS:
	default:
		hadc1.Init.OversamplingMode = DISABLE;
		hadc1.Init.Resolution = ADC_RESOLUTION_12B;
		 hadc1.Init.Oversampling.RightBitShift = ADC_RIGHTBITSHIFT_NONE;
		break;


