paulusTecnion/uberlogger-stm32/Core/Src/main.c
	}

	return 0;

}


static void ADC_Reinit()
{
	  if (HAL_ADC_Init(&hadc1) != HAL_OK)
	  {
	    Error_Handler();
	  }

}

void Config_Handler()
{
	uint8_t retVal;
	retVal = HAL_SPI_Receive(&hspi1,  RxBuffer, 2, 250);

	  if( retVal == HAL_ERROR)
	  {
		  /* Transfer error in transmission process */
		  Error_Handler();
	  }
	  else if (retVal == HAL_OK)
	  {
		  switch(RxBuffer[0])
		  {
			  case CMD_NOP:
				  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_NOP);
				  break;

			  case CMD_MEASURE_MODE:
				  // Re-init ADC
				  if (HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_MEASURE_MODE) == HAL_OK)
				  {
					  ADC_Reinit();
					  NextState = MAIN_IDLE;
				  }
				  break;

			  case CMD_SET_RESOLUTION:
				  if (!Config_Set_Resolution(RxBuffer[1]))
				  {
					  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_SET_RESOLUTION);
				  } else {
					  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_SET_RESOLUTION);
				  }

				  break;


			  case CMD_SET_SAMPLE_RATE:
			 				// receive setting
				if (!Config_Set_Sample_freq(RxBuffer[1]))
				{
					HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_SET_SAMPLE_RATE);
				} else {
					HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_SET_SAMPLE_RATE);
				}
			 	break;

			  case CMD_SET_ADC_CHANNELS_ENABLED:
				  if (!Config_Set_Adc_channels(RxBuffer[1]))
				  {
					  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_SET_ADC_CHANNELS_ENABLED);
				  } else {
					  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_SET_ADC_CHANNELS_ENABLED);
				  }
				  break;

//			  case CMD_CONFIG_SET_DAC_PWM:
//
//				  break;

			  default:
				  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_UNKNOWN);

		  }
	  }

//	if (msgRx)
//	{
//		switch(RxBuffer[0])
//		{
//			case CMD_NOP:
//
//			break;
//
//			case CMD_MEASURE_MODE:
//			// Re-init ADC
//			ADC_Reinit();
//			if (Send_OK())
//			{
//				MainState = MAIN_IDLE;
//			}
//			break;
//
//
//
//			case CMD_SET_RESOLUTION:
//				if (Config_Set_Resolution(RxBuffer[1]))
//				{
//					Send_OK();
//				} else {
//					Send_NOK();
//				}
//
//			break;
//
//
//			case CMD_SET_SAMPLE_RATE:
//			// receive setting
//			if (Config_Set_Sample_freq(RxBuffer[1]))
//			{
//				Send_OK();
//			} else {
//				Send_NOK();
//			}
//			break;
//
//			//			  case CMD_CONFIG_SET_DAC_PWM:
//			//
//			//				  break;
//
//			default:
//			Send_NOK();
//		}
//	msgRx = 0;
//	}

}
void Idle_Handler()
{
	uint8_t retVal;

//	if (msgRx)
//	{
//		switch(RxBuffer[0])
//			  {
//				  //case CMD_ADC_START:
//					//if (Send_OK())
//					//{
//					//	MainState = MAIN_ADC_START;
//					//}
//
//				  case CMD_SETTINGS_MODE:
//					  if (Send_OK())
//					  {
//						MainState = MAIN_CONFIG;
//					  }
//
//				  break;
//
//				  case CMD_NOP:
//					  break;
//
//				  default:
//					Send_NOK();
//
//			  }
//		msgRx = 0;
//	}
//	 Blocking SPI read with 1000 clock cycles timeout.
	retVal = HAL_SPI_Receive(&hspi1,  RxBuffer, 2, 250);
	if( retVal == HAL_ERROR)
	{
	  /* Transfer error in transmission process */
	  Error_Handler();
	}
	else if (retVal == HAL_OK)
	{
	  switch(RxBuffer[0])
	  {
		  //case CMD_ADC_START:
			//if (Send_OK())
			//{
			//	MainState = MAIN_ADC_START;
			//}

		  case CMD_SETTINGS_MODE:
			  if (HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_SETTINGS_MODE) == HAL_OK)
			  {
				NextState = MAIN_CONFIG;
			  }

		  break;

		  case CMD_NOP:
			  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_NOP);
			  break;

		  default:
			  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_UNKNOWN);

	  }
	}
}

//uint8_t Config_Set_Sample_freq(uint8_t sampleFreq)
//{
//	return 1;
//}


//
//uint8_t Send_OK(void)
//{
//
//	t.t8[0] = RESP_OK;
//	t.t8[1] = 0x00;
//	HAL_StatusTypeDef errorcode;
//
//	errorcode = HAL_SPI_TransmitReceive_DMA(&hspi1, t.t8, RxBuffer, 2);
//
//	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_SET);
////	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
//	if (errorcode == HAL_OK)
//	{
//		return 1;
//	} else {
//		return 0;
//	}
//}
//uint8_t Send_NOK(void)
//{
//
//	t.t8[0]= RESP_NOK;
//	t.t8[1] = 0x00;
//	HAL_StatusTypeDef errorcode;
//
//	errorcode = HAL_SPI_TransmitReceive_DMA(&hspi1, t.t8, RxBuffer, 2);
//	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_SET);
////	HAL_GPIO_WritePin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin, GPIO_PIN_RESET);
//	if (errorcode == HAL_OK)
//	{
//		return 1;
//	} else {
//		return 0;
//	}
//}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
